# UniqueId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetPreview..::..UniqueId Property
WorksetPreview Class See Also
---
UniqueId of the workset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Guid UniqueId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UniqueId As Guid
	Get
```

Visual C++
---
```text
public:
property Guid UniqueId {
	Guid get ();
}
```

# Remarks
Stable identifier for a workset, UniqueId will not change while synchronizing with central.
# See Also
WorksetPreview Class
Autodesk.Revit.DB Namespace